# ClassificationEntry Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClassificationEntry Class
Members See Also
---
Represents an entry in the classification table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ClassificationEntry : KeyBasedTreeEntry
```

Visual Basic
---
```text
Public Class ClassificationEntry _
	Inherits KeyBasedTreeEntry
```

Visual C++
---
```text
public ref class ClassificationEntry : public KeyBasedTreeEntry
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..KeyBasedTreeEntry Autodesk.Revit.DB..::..ClassificationEntry
# See Also
ClassificationEntry Members
Autodesk.Revit.DB Namespace